export const leagueFields = ['축구', '농구'];

export const teamInfoOptions = {
    축구: ["건축대학", "경상대학", "경영대학", "경영대학 AI빅데이터융합경영학과", "경영대학 경영정보학부", "경영대학 재무금융회계학부", "과학기술대학 나노전자물리학과",
        "과학기술대학 산림환경시스템학과 & 임산생명공학과", "글로벌인문지역대학 & 사회과학대학", "법과대학", "사회과학대학 미디어광고학부",
        "사회과학대학 사회학과", "사회과학대학 정치외교학과", "사회과학대학 행정학과", "소프트웨어융합대학", "자동차융합대학", "창의공과대학 건설시스템공학부",
        "창의공과대학 기계공학부", "창의공과대학 신소재공학부", "창의공과대학 전자공학부", "체육대학", "학군단", "기타"],
    농구: ["건축대학", "경상대학", "경영대학", "과학기술대학", "글로벌인문지역대학 & 사회과학대학", "법과대학", "사회과학대학 미디어광고학부",
        "소프트웨어융합대학", "자동차융합대학", "창의공과대학 건설시스템공학부", "창의공과대학 전자공학부", "기타"]
};

export const soccerTeamDivisionOptions = {
    "건축대학": ['FC SCALE'],
    "경상대학": ['쉐도우'],
    "경영대학": ['바이퍼스'],
    "경영대학 AI빅데이터융합경영학과": ['BAS'],
    "경영대학 경영정보학부": ['FC BIT'],
    "경영대학 재무금융회계학부": ['FIAV'],
    "과학기술대학 나노전자물리학과": ['네피스트'],
    "과학기술대학 산림환경시스템학과 & 임산생명공학과": ['포레스트'],
    "글로벌인문지역대학 & 사회과학대학": ['야스크'],
    "법과대학": ['컬스'],
    "사회과학대학 미디어광고학부": ['로니즈'],
    "사회과학대학 사회학과": ['아레스'],
    "사회과학대학 정치외교학과": ['꺄멜레온'],
    "사회과학대학 행정학과": ['판타지스타'],
    "소프트웨어융합대학": ['CS슈팅'],
    "자동차융합대학": ['KAFA'],
    "창의공과대학 건설시스템공학부": ['레알모멘트'],
    "창의공과대학 기계공학부": ['공사랑'],
    "창의공과대학 신소재공학부": ['포리원'],
    "창의공과대학 전자공학부": ['KESA'],
    "체육대학": ['한마음'],
    "학군단": ['아이구'],
    "기타": ['FOCUS', 'NS'],
};

export const basketballTeamDivisionOptions = {
    "건축대학": ['아키템포'],
    "경상대학": ['맨큐'],
    "경영대학": ['CEO'],
    "과학기술대학": ['STEP'],
    "글로벌인문지역대학 & 사회과학대학": ['FM'],
    "법과대학": ['MBL'],
    "사회과학대학 미디어광고학부": ['워닝'],
    "소프트웨어융합대학": ['CS점핑'],
    "자동차융합대학": ['FWD'],
    "창의공과대학 건설시스템공학부": ['GG'],
    "창의공과대학 전자공학부": ['코티스트'],
    "기타": ['KUBA', 'TAB'],
};
